app/Models/Transaksi.php

    public function getTransaksi($id_transaksi = false){
        if($id_transaksi == false) {
            return $this->findAll();
---
SELECT *
FROM `transaksi`